{
    "helloIm": "Xin chào, tôi là",
    "fullName": "Hoàng Văn Chính",
    "profileDescription": "Là một Front-end Developer chuyên sâu về ReactJS với hơn 2.5 năm kinh nghiệm. Tôi có 1.5 năm phát triển hệ thống thương mại điện tử và các dự án outsourcing, cùng hơn 1 năm kinh nghiệm về Blockchain & DeFi. Tôi luôn chú trọng trải nghiệm người dùng, hiệu năng và chất lượng sản phẩm trong suốt quá trình phát triển.",
    "projectsOverview": "Tổng quan dự án",
    "frontendDeveloper": "Lập trình viên Front-end",
    "duration": "Thời gian",
    "months": "tháng",
    "role": "Vai trò",
    "teamSize": "Thành viên",
    "projectCexDesc": "Dự án sàn giao dịch tập trung (CEX) cung cấp chức năng Spot, Futures, nạp/rút tiền, KYC và các tính năng liên quan.",
    "mainResponsibilities": "Vai trò và nhiệm vụ chính",
    "frontendPosition": "Vị trí Frontend",
    "collaborationDesc": "Giao tiếp và phối hợp với Backend, BA và Tester.",
    "developSpot": "Phát triển chức năng Spot",
    "developFutures": "Phát triển chức năng Futures",
    "developDepositWithdraw": "Xây dựng chức năng Nạp / Rút tiền",
    "integrateWebsocket": "Tích hợp WebSocket cho dữ liệu giao dịch real-time",
    "buildAdminDashboard": "Xây dựng ADMIN Dashboard quản trị hệ thống",
    "buildUiUx": "Xây dựng giao diện, xử lý responsive và hiệu ứng cho toàn bộ hệ thống",
    "buildLandingNode": "Xây dựng Landing Page NODE",
    "buildLandingReferral": "Xây dựng Landing Page Referral Program",
    "buildLandingBroker": "Xây dựng Landing Page Broker",
    "featureImplementationDetails": "Chi tiết triển khai chức năng",
    "spotTrading": "Spot Trading",
    "spotTradingDesc": "Xây dựng giao diện giao dịch Spot bao gồm order book, biểu đồ giá và form đặt lệnh (Buy/Sell). Tích hợp WebSocket để cập nhật giá, khối lượng và trạng thái lệnh theo thời gian thực; xử lý validate input, trạng thái lệnh và đồng bộ dữ liệu với REST API.",
    "futuresTrading": "Futures Trading",
    "futuresTradingDesc": "Phát triển giao diện Futures với các khái niệm như leverage, position, margin và PnL. Xử lý luồng dữ liệu real-time, trạng thái vị thế, đóng/mở lệnh và hiển thị rủi ro theo thời gian thực.",
    "depositWithdraw": "Nạp / Rút tiền",
    "depositWithdrawDesc": "Xây dựng UI luồng nạp và rút tài sản, hiển thị lịch sử giao dịch và trạng thái xử lý. Tích hợp API, validate dữ liệu, xử lý loading, error và các trạng thái bảo mật liên quan.",
    "adminDashboardDesc": "Xây dựng hệ thống quản trị với dashboard tổng quan, bảng dữ liệu, lọc, phân trang và các chức năng CRUD để quản lý người dùng, giao dịch, tài sản và cấu hình hệ thống.",
    "viewWebsite": "Xem website",
    "buildSignalSystem": "Xây dựng hệ thống Signals Futures & Spot",
    "buildUiSystem": "Xây dựng giao diện, xử lý responsive và hiệu ứng cho toàn bộ hệ thống",
    "buildAdminCms": "Xây dựng Admin CMS (quản lý gói, ví, tài sản, phân quyền vai trò)",
    "designRealtimeDashboard": "Thiết kế UI dashboard realtime cho bot Futures & Spot",
    "integrateExchangeApi": "Tích hợp API Binance / Bitget thông qua API Key người dùng",
    "implementTradingSignals": "Triển khai hệ thống tín hiệu giao dịch và trạng thái lệnh",
    "buildDepositWithdraw2fa": "Xây dựng luồng nạp / rút tài sản và bảo mật 2FA",
    "buildNotification": "Xây dựng chức năng thông báo trong ứng dụng",
    "dashboardAnalytics": "Bảng điều khiển & Phân tích",
    "dashboardAnalyticsDesc": "KPI User, Financial, Withdrawal; biểu đồ tăng trưởng, top investor và các yêu cầu đang chờ xử lý.",
    "userTransaction": "Người dùng & Giao dịch",
    "userTransactionDesc": "Quản lý người dùng, xác minh/chặn tài khoản, lịch sử nạp–rút–mua gói, điều chỉnh số dư, API Key, AUM, PnL, debt và commission (hoa hồng).",
    "packageVoucherCommission": "Gói, Voucher & Commission",
    "packageVoucherCommissionDesc": "Quản lý gói, voucher và hệ thống hoa hồng đa cấp (F1–F3) theo mô hình package-based và profit-sharing.",
    "groupTradingSignals": "Nhóm & Tín hiệu giao dịch",
    "groupTradingSignalsDesc": "Quản lý nhóm Spot/Futures, tín hiệu giao dịch, lịch sử lệnh, PnL và hiệu suất theo thời gian thực.",
    "walletSystem": "Ví & Hệ thống",
    "walletSystemDesc": "Hệ thống ví, asset/chain, cặp giao dịch, luồng tài chính và audit log.",
    "adminPermission": "Phân quyền Admin",
    "adminPermissionDesc": "Quản lý quyền truy cập và CRUD theo vai trò (role-based access control).",
    "close": "Đóng",
    "xaiFinanceTitle": "X-AIFinance - Nền tảng đầu tư sinh lời (DeFi)",
    "xaiFinanceDesc": "Nền tảng đầu tư sinh lời, nơi người dùng đầu tư vào các quỹ và nhận lợi nhuận.",
    "developInvestmentFund": "Phát triển chức năng Quỹ đầu tư, theo dõi lợi nhuận",
    "buildLandingUi": "Xây dựng giao diện, hiệu ứng và responsive cho trang giới thiệu",
    "buildAdminDashboard2": "Xây dựng Admin Dashboard",
    "connectWalletLogin": "Đăng nhập bằng kết nối ví",
    "changeWalletAddress": "Xây dựng chức năng thay đổi địa chỉ ví",
    "investmentFund": "Investment Fund",
    "investmentFundDesc": "Phát triển giao diện quỹ đầu tư, theo dõi số tiền tham gia, lợi nhuận, lịch sử giao dịch và trạng thái phân phối.",
    "connectWalletAuth": "Kết nối ví & Xác thực",
    "connectWalletAuthDesc": "Triển khai đăng nhập bằng ví (Kết nối ví).",
    "dailyClaimReward": "Nhận thưởng hằng ngày / Check-in",
    "dailyClaimRewardDesc": "Xây dựng tính năng check-in nhận thưởng hằng ngày theo gói, hiển thị reward, trạng thái claim và tổng thu nhập, tích hợp reCAPTCHA v3 để hạn chế bot spam nhận thưởng.",
    "tokenSwap": "Token Swap",
    "tokenSwapDesc": "Phát triển luồng swap USDT sang token nội bộ, hiển thị tỷ giá, số lượng nhận được và lịch sử giao dịch.",
    "seedSaleVesting": "Seed Sale & Vesting Reward",
    "seedSaleVestingDesc": "Xây dựng giao diện Seed Sale, theo dõi tiến độ phân phối và claim reward theo chu kỳ vesting.",
    "adminDashboard": "Admin Dashboard",
    "adminDashboardDesc2": "Xây dựng hệ thống quản trị: dashboard, quản lý người dùng, giao dịch, cấu hình hệ thống và phân quyền admin.",
    "walletManagement": "Quản lí Ví",
    "walletManagementDesc": "Xây dựng chức năng thay đổi địa chỉ ví, validate quyền sở hữu ví và đồng bộ cập nhật với hệ thống.",
    "changedWallet": "Đổi địa chỉ ví",
    "changedWalletDesc": "Xây dựng chức năng thay đổi địa chỉ ví",
    "videoReview": "Video giới thiệu",
    "technologyStack": "Công nghệ sử dụng",
    "personalOverview": "Tổng quan cá nhân",
    "education": "Học vấn",
    "university": "Đại học Công Thương TP.HCM – An Toàn Thông Tin (An toàn hệ thống)",
    "achievements": "Thành tích",
    "studentResearch": "Top 20 sinh viên xuất sắc – Nghiên cứu khoa học cấp khoa",
    "innovationStartup": "Sáng tạo & khởi nghiệp (Ứng dụng hỗ trợ thi chứng chỉ trực tuyến)",
    "certification": "Chứng chỉ",
    "autoTradingBotProject": "Dự án bot giao dịch tự động, cho phép người dùng kết nối API Binance / Bitget và thực hiện giao dịch tự động."
}